Public Attributes | List of all members
API_ModelViewOptions Struct Reference
Project Navigator
Represents the model view options. More...
#include <APIdefs_ViewSettings.hpp>
 Public Attributes
char  | doorMode
Door display definition. (API_Hole_ShowWithDim...API_Hole_HideHole)
char  | windowMode
Window display definition. (API_Hole_ShowWithDim...API_Hole_HideHole)
char  | skylightMode
Skylight display definition. (API_Hole_ShowWithDim...API_Hole_HideHole)
char  | sectionMarker
Specifies the section markers visibility (Archicad only).
char  | beamMethod
Specifies the beam drawing style (Archicad only). (API_Beam_Drawing_Full, API_Beam_Drawing_RefLine, API_Beam_Drawing_Contour)
char  | roofShellMode
Specifies the roof shell drawing style: API_RoofShellShow_AllDetails, API_RoofShellShow_TopSurface, API_RoofShellShow_ContourDrawing.
char  | showColumnSymbol
Specifies whether column symbols are displayed on the floor plan (Archicad only): API_Column_Symbol_Show, API_Column_Symbol_Hide
char  | slabMethod
For adjoining slabs with the same top surface and top height: API_Slab_ShowCommonEdges, API_Slab_EliminateCommonEdges, API_Slab_HiddenCommonEdges
bool  | coluHiddenlineUnderSlabs
Use hidden line under slab in columns.
bool  | beamHiddenlineUnderSlabs
Use hidden line under slab in beams.
bool  | zoneHideZoneStamp
Tells whether the zone stamps should be visible.
API_CurtainWallModelViewOptions  | curtainWallModelViewOptions
Structure of Curtain Wall Model View Options.
API_StairModelViewOptions  | stairModelViewOptions
Structure of Stair Model View Options.
API_RailingModelViewOptions  | railingModelViewOptions
Structure of Railing Model View Options.
API_GDLModelViewOptions *  | gdlOptions
Array of GDL related view options (GSPtr). It has an effect only on library part based elements' appearence (window, door, object, lamp).
Detailed Description
Represents the model view options.
Remarks
These settings correspond to the relevant items in the Document/Set Model View/Model View Options dialog. Model view options are also part of the navigator view definition (API_NavigatorView). Call the ACAPI_Navigator_GetViewOptions or ACAPI_Navigator_ChangeViewOptions function codes to operate on this data. Remember to dispose of the gdlOptions pointer when it is not needed anymore. Refer to the ACAPI_FreeGDLModelViewOptionsPtr to do that.
Member Data Documentation
◆ beamHiddenlineUnderSlabs
 API_ModelViewOptions::beamHiddenlineUnderSlabs
Use hidden line under slab in beams.
◆ beamMethod
 API_ModelViewOptions::beamMethod
Specifies the beam drawing style (Archicad only). (API_Beam_Drawing_Full, API_Beam_Drawing_RefLine, API_Beam_Drawing_Contour)
◆ coluHiddenlineUnderSlabs
 API_ModelViewOptions::coluHiddenlineUnderSlabs
Use hidden line under slab in columns.
◆ curtainWallModelViewOptions
 API_ModelViewOptions::curtainWallModelViewOptions
Structure of Curtain Wall Model View Options.
◆ doorMode
 API_ModelViewOptions::doorMode
Door display definition. (API_Hole_ShowWithDim...API_Hole_HideHole)
◆ gdlOptions
 API_ModelViewOptions::gdlOptions
Array of GDL related view options (GSPtr). It has an effect only on library part based elements' appearence (window, door, object, lamp).
◆ railingModelViewOptions
 API_ModelViewOptions::railingModelViewOptions
Structure of Railing Model View Options.
◆ roofShellMode
 API_ModelViewOptions::roofShellMode
Specifies the roof shell drawing style: API_RoofShellShow_AllDetails, API_RoofShellShow_TopSurface, API_RoofShellShow_ContourDrawing.
◆ sectionMarker
 API_ModelViewOptions::sectionMarker
Specifies the section markers visibility (Archicad only).
 Marker  | Meaning
 API_Section_Marker_Normal  | Section Markers are fully displayed on the floor plan.
 API_Section_Marker_KeyPlan  | Section Markers are displayed with only one marker at the midpoint between the
two ends of the imaginary Section Line.| |API_Section_Marker_AsInSettings|Section Markers are displayed as they are set in the Section Settings dialog box.
◆ showColumnSymbol
 API_ModelViewOptions::showColumnSymbol
Specifies whether column symbols are displayed on the floor plan (Archicad only): API_Column_Symbol_Show, API_Column_Symbol_Hide
◆ skylightMode
 API_ModelViewOptions::skylightMode
Skylight display definition. (API_Hole_ShowWithDim...API_Hole_HideHole)
◆ slabMethod
 API_ModelViewOptions::slabMethod
For adjoining slabs with the same top surface and top height: API_Slab_ShowCommonEdges, API_Slab_EliminateCommonEdges, API_Slab_HiddenCommonEdges
◆ stairModelViewOptions
 API_ModelViewOptions::stairModelViewOptions
Structure of Stair Model View Options.
◆ windowMode
 API_ModelViewOptions::windowMode
Window display definition. (API_Hole_ShowWithDim...API_Hole_HideHole)
◆ zoneHideZoneStamp
 API_ModelViewOptions::zoneHideZoneStamp
Tells whether the zone stamps should be visible.